import Image from 'next/dist/client/image';
import styles from '../styles/MainNews.module.scss';
import CategoryBtn, { CategoryBtn2 } from './CategoryBtn';
import LatestNewsForm, { LatestNewsBlock } from './LatestNewsForm';
import { NewsForm2 } from './NewsForm';

export default function MainNews() {
  const img = '/img/image3.png';
  const img2 = '/img/image16.png';

  const NewsArticle = () => {
    return (
      <section>
        <div className={styles.newsArticle}>
          <div>
            <h1>Елена Рыбакина творит историю на Уимблдоне. Финал, которого не ждали</h1>
            <section className={styles.publishDate}>
              <div>
                <button>Общество</button>
                <span>09:30, 10 Июля 2022</span>
              </div>
              <div className={styles.views}>
                <svg viewBox="0 0 28 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M12.8278 0.0460103C10.1055 0.258374 7.34501 1.32409 4.89514 3.10831C3.33964 4.24117 1.75695 5.7971 0.531684 7.39802C0.112397 7.9458 0 8.17932 0 8.5026C0 8.84754 0.11989 9.07393 0.675037 9.77745C3.17036 12.9397 6.04947 15.0849 9.32538 16.2228C12.6717 17.3851 16.4096 17.2393 19.7701 15.8152C22.1212 14.8189 24.5509 13.0051 26.4669 10.8159C27.2519 9.91899 27.8151 9.18802 27.9222 8.92688C28.0264 8.67309 28.0259 8.33077 27.9209 8.07509C27.7269 7.60236 26.058 5.65668 25.0294 4.70404C21.3242 1.27248 17.215 -0.296255 12.8278 0.0460103ZM15.4238 2.70262C17.3261 3.21571 18.8225 4.58082 19.5044 6.42528C19.7681 7.13832 19.8267 7.52313 19.8255 8.53044C19.8244 9.38669 19.8101 9.52895 19.6759 10.0217C19.3832 11.0964 18.9121 11.9177 18.1342 12.7096C17.3564 13.5014 16.5496 13.981 15.494 14.279C15.0099 14.4157 14.8702 14.4302 14.0291 14.4313C13.0396 14.4326 12.6616 14.3729 11.9612 14.1045C10.1491 13.4101 8.80234 11.8796 8.30566 9.95028C8.16488 9.40334 8.11232 8.23077 8.20059 7.60587C8.50059 5.48262 10.0007 3.63059 12.0317 2.87601C12.7468 2.6103 13.2035 2.54482 14.1658 2.56988C14.7805 2.58592 15.1264 2.62244 15.4238 2.70262ZM13.236 5.36079C11.8432 5.73257 10.8295 7.05363 10.8295 8.49681C10.8295 10.2833 12.2501 11.732 14.0017 11.732C15.4376 11.732 16.7328 10.6943 17.0913 9.25651C17.1975 8.83033 17.1972 8.11529 17.0904 7.69813C16.8052 6.58314 15.8851 5.64983 14.7869 5.3614C14.3748 5.25316 13.6403 5.25288 13.236 5.36079Z"
                    fill="#838B98"
                  />
                </svg>
                <span>1230</span>
              </div>
            </section>
            <div className={styles.imageBox}>
              <Image src={img} alt="img" width={873} height={469} />
              <p>Елена Рыбакина / Фото Informburo.kz</p>
            </div>
            <h3>
              9 июля на Уимблдоне титул в женском одиночном разряде разыграют Унс Джабир из Туниса и
              казахстанка Елена Рыбакина.
            </h3>
            <p>
              Вечером на Центральном корте Всеанглийского лаун-теннисного клуба, где в 135-й раз
              проходит Уимблдонский турнир, титул в женском одиночном разряде разыграют Унс Джабир
              из Туниса и наша Елена Рыбакина. Неожиданно? Да. Но и приятно!..
            </p>
          </div>
          <div className={styles.imageBox}>
            <Image src={img2} alt="img" width={873} height={469} />
            <p>
              Финалистки Уимблдонского турнира-2022 в женском одиночном разряде Елена Рыбакина
              (Казахстан) – Унс Джабир (Тунис) / Коллаж с сайта Федерации тенниса Казахстана
            </p>
          </div>

          <div>
            <h3>Первопроходец Слава</h3>
            <p>
              В 2010 году Ярослава Шведова, нынешний капитан (главный тренер) женской сборной
              Казахстана, первой из наших теннисистов стала победительницей турнира "Большого
              шлема". Случилось это как раз на Уимблдоне, где она первенствовала в паре с
              американкой Ваней Кинг. А через два месяца они выиграли и Открытый чемпионат США.
            </p>
            <p>
              Доходили до финала "Ролан Гарроса-2021" Александр Бублик и Андрей Голубев: были близки
              к победе (при счёте 6:4, 5:4 Саша подавал на матч, но провалил подачу) и… всё же
              уступили хозяевам турнира Николя Маю и Пьеру-Югу Эрберу.
            </p>{' '}
            <p>
              Ну и Анна Данилина с бразильянкой Беатрис Хаддад Майя играли в финале Открытого
              чемпионата Австралии-2022.
            </p>{' '}
            <p>
              {' '}
              А вот в одиночном разряде лучшим достижением наших теннисистов на "мейджорах" всё это
              время оставался выход в четвертьфинал: по три раза – Шведова и Юлия Путинцева. Тем
              приятнее отметить, что на нынешнем Уимблдоне 23-летняя Елена Рыбакина улучшила это
              достижение, пробившись сначала в полуфинал, а затем и в финал.
            </p>
          </div>
          <div className={styles.imageBox}>
            <Image src={img2} alt="img" width={873} height={469} />
            <p>
              Перед началом полуфинального матча Уимблдонского турнира-2022 между Татьяной Марией
              (Германия) и Унс Джабир (Тунис) / Фото Джоэла Марклунда, AELTC
            </p>
          </div>
        </div>
        <Hashtags />
        <AlsoRead />
      </section>
    );
  };

  const Hashtags = () => {
    const hashtags = ['smile', 'friends ', 'fun ', 'animals', 'beautiful', 'wild', 'politics'];

    return (
      <div className={styles.hashtags}>
        <ul>
          {hashtags.map((tag, index) => (
            <li key={index}>
              <a>#{tag}</a>
            </li>
          ))}
        </ul>
      </div>
    );
  };

  const AlsoRead = () => {
    return (
      <div className={styles.alsoRead}>
        <h2>Читайте также:</h2>
        <div className={styles.alsoReadContent}>
          <NewsForm2 styles="true" />
          <NewsForm2 styles="true" />
          <NewsForm2 styles="true" />
        </div>
      </div>
    );
  };

  return (
    <section>
      <div className="container">
        <div className="advBanner1">Рекламный баннер</div>
        <div className={styles.column_wrapper}>
          <div className={styles.socialColumns}>
            <div className={styles.socialIcons}>
              <a>
                <svg
                  width="22"
                  height="22"
                  viewBox="0 0 22 22"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M10.8 0C4.8357 0 0 4.8357 0 10.8C0 12.8261 0.569107 14.7151 1.53984 16.3354L0.0966797 21.6L5.47383 20.1885C7.04642 21.0826 8.86184 21.6 10.8 21.6C16.7643 21.6 21.6 16.7643 21.6 10.8C21.6 4.8357 16.7643 0 10.8 0ZM7.10332 5.76211C7.27882 5.76211 7.45914 5.76104 7.61484 5.76914C7.80745 5.77364 8.01707 5.78775 8.21777 6.23145C8.45627 6.75885 8.97559 8.08192 9.04219 8.21602C9.10879 8.35012 9.15598 8.50809 9.06328 8.68359C8.97508 8.86359 8.92921 8.97254 8.79961 9.13184C8.66551 9.28664 8.51857 9.4789 8.39707 9.5959C8.26297 9.73 8.1245 9.87704 8.2793 10.1443C8.4341 10.4116 8.97171 11.2879 9.76641 11.9953C10.7879 12.9079 11.6498 13.1884 11.918 13.3225C12.1862 13.4566 12.3415 13.4357 12.4963 13.2557C12.6556 13.0802 13.1653 12.478 13.3453 12.2098C13.5208 11.9416 13.7 11.988 13.943 12.0762C14.1896 12.1644 15.5047 12.8122 15.7729 12.9463C16.0411 13.0804 16.2169 13.1468 16.2844 13.2557C16.3537 13.3682 16.3537 13.9037 16.1314 14.5283C15.9091 15.152 14.8175 15.7552 14.3279 15.7975C13.8338 15.8434 13.3727 16.0196 11.1164 15.1313C8.39481 14.0594 6.67844 11.2718 6.54434 11.0918C6.41024 10.9163 5.45449 9.64252 5.45449 8.32852C5.45449 7.01002 6.14579 6.36429 6.38789 6.09609C6.63449 5.82789 6.92332 5.76211 7.10332 5.76211Z"
                    fill="white"
                  />
                </svg>
              </a>
              <a>
                <svg
                  width="10"
                  height="21"
                  viewBox="0 0 10 21"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M8.732 0H7.64965C4.64138 0 2.194 2.47605 2.194 5.51947V7.84886H0.344828C0.154414 7.84886 0 8.00507 0 8.19771V10.9886C0 11.1812 0.154414 11.3374 0.344828 11.3374H2.19386V19.8848C2.19386 20.0775 2.34828 20.2337 2.53869 20.2337H5.29731C5.48772 20.2337 5.64214 20.0775 5.64214 19.8848V11.3374H8.386C8.57641 11.3374 8.73083 11.1812 8.73083 10.9886V8.19771C8.73083 8.00507 8.57641 7.84886 8.386 7.84886H5.64214V5.51947C5.64214 4.39964 6.54269 3.48857 7.64952 3.48857H8.73186C8.92227 3.48857 9.07669 3.33235 9.07669 3.13971V0.348857C9.07683 0.156218 8.92241 0 8.732 0Z"
                    fill="white"
                  />
                </svg>
              </a>
              <a>
                <svg
                  width="20"
                  height="17"
                  viewBox="0 0 20 17"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M18.6396 0.0185071C18.6027 0.0336537 18.0292 0.256123 17.3653 0.512843C12.4323 2.42009 0.438177 7.10751 0.329793 7.17046C0.256107 7.21326 0.148706 7.31883 0.0910716 7.40503C0.00495458 7.53393 -0.0102478 7.60475 0.00544638 7.80384C0.0412167 8.25706 0.00607232 8.23918 2.64838 9.15026C3.92364 9.58997 4.99451 9.94975 5.02809 9.94975C5.06162 9.94975 7.52928 8.43131 10.5118 6.57542C13.4942 4.71952 15.9898 3.1923 16.0574 3.18157C16.1631 3.16483 16.1804 3.17765 16.1804 3.27263C16.1804 3.35996 15.7939 3.74486 14.3369 5.10856C8.75933 10.329 7.88511 11.1558 7.87428 11.2206C7.86776 11.2596 7.7934 12.2638 7.70898 13.4521C7.57131 15.391 7.56246 15.6234 7.6226 15.7171C7.71721 15.8644 7.88658 15.9343 8.02295 15.8824C8.08394 15.8591 8.71668 15.2605 9.42904 14.5521C10.2942 13.6918 10.743 13.2757 10.7808 13.2989C10.8118 13.318 11.8646 14.1254 13.1204 15.093C14.3761 16.0607 15.4667 16.8856 15.5438 16.9262C15.621 16.9668 15.7865 17 15.9116 17C16.2799 17 16.5765 16.8023 16.7108 16.4674C16.7387 16.3976 17.4976 12.9427 18.397 8.78988C20.1964 0.482095 20.1186 0.921438 19.8654 0.504883C19.6716 0.18603 19.3808 0.0166421 19.0026 0.0022232C18.8398 -0.00400831 18.6765 0.00331493 18.6396 0.0185071Z"
                    fill="white"
                  />
                </svg>
              </a>
            </div>
          </div>
          <div className={styles.column1}>
            <NewsArticle />
            <div className={styles.banner}>Рекламный баннер</div>
            <NewsArticle />
          </div>
          <div className={styles.column2}>
            <LatestNewsBlock styles="true" />
            <div className={styles.bannerTwo}>Рекламный баннер</div>
            <div className={styles.column_content}>
              <div>
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
              </div>
              <div>
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
              </div>
              <div>
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
              </div>
              <div>
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
              </div>
              <div>
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
                <LatestNewsForm />
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
}
