
const NEWS = [
    {category: 'Общество', title: 'Елена Рыбакина творит историю на Уимблдоне. Финал, которого не ждали', subtitle: '9 июля на Уимблдоне титул в женском одиночном разряде разыграют казахстанка Елена Рыбакина и Онс Жабёр из Туниса...', img: ''},
    {category: 'Политика', title: 'Токаев выразил соболезнования в связи со смертью экс-премьера Японии', subtitle: '', img: ''},
    {category: 'Здравоохранение', title: 'Ситуация по коронавирусу в Казахстане на 9 июля', subtitle: 'Озвучены данные по распространению COVID-19 в Казахстане на 9 июля...', img: ''},    
]

export default NEWS;